package main

func main()  {
	//编写一个 SQL 查询来实现分数排名。如果两个分数相同，则两个分数排名（Rank）相同。
	//平分后的下一个名次应该是下一个连续的整数值。换句话说，名次之间不应该有“间隔”。
	//Scores 表
  /*+----+-------+
	| Id | Score |
    +----+-------+
	| 1  | 3.50  |
	| 2  | 3.65  |
	| 3  | 4.00  |
	| 4  | 3.85  |
	| 5  | 4.00  |
	| 6  | 3.65  |*/

  //结果：
  /*+-------+------+
	| Score | Rank |
	+-------+------+
	| 4.00  | 1    |
	| 4.00  | 1    |
	| 3.85  | 2    |
	| 3.65  | 3    |
	| 3.65  | 3    |
	| 3.50  | 4    |
	+-------+------+*/

    //MySQL:8.0版本才支持窗口函数
   //SQL语句： select Score,dense_rank() over(order by score desc) AS "Rank" from tables
   //dense_rank() 连续排序
   //rank() 跳跃排序
}